modules/OpenQBMM/tutorials/mixingTransportFoam/twoStreamsQMOM/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -3 0 0 0 0 ];

internalField   nonuniform List<scalar> 
3000
(
0.000174417263056
7.33054602471e-05
3.21567790117e-05
1.49832734896e-05
7.45138230528e-06
3.95319402039e-06
2.22717759996e-06
1.32521137178e-06
...
)
;

boundaryField
{
    inlet1
    {
        type            fixedValue;
        value           uniform 4.93691e-08;
    }
    inlet2
    {
        type            fixedValue;
        value           uniform 4.93691e-08;
    }
    outlet
    {
        type            zeroGradient;
    }
    walls
    {
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        type            epsilonWallFunction;
        value           nonuniform List<scalar> 
200
(
0.000174417263056
0.000273957433312
0.000171627546574
0.000111656247855
7.64605111792e-05
5.79738086756e-05
4.74248123813e-05
4.1375926335e-05
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
